In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(columns=["Name", "Age", "Height"])

In [5]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [6]:
df.loc[0] = ["Allen", 25, 175]

In [7]:
df

    Name  Age  Height
0  Allen   25     175

In [8]:
df.loc[1] = ["Ted", 30, 180]

In [9]:
df

    Name  Age  Height
0  Allen   25     175
1    Ted   30     180

In [10]:
df["Weight"] = [75, 80]

In [11]:
df

    Name  Age  Height  Weight
0  Allen   25     175      75
1    Ted   30     180      80

In [14]:
df.drop(1, axis=0)

    Name  Age  Height  Weight
0  Allen   25     175      75

In [15]:
df

    Name  Age  Height  Weight
0  Allen   25     175      75
1    Ted   30     180      80

In [16]:
df = df.drop(1, axis=0)

In [17]:
df

    Name  Age  Height  Weight
0  Allen   25     175      75

In [18]:
df.drop("Weight", axis=1)

    Name  Age  Height
0  Allen   25     175

In [19]:
df.drop(["Age", "Weight"], axis=1)

    Name  Height
0  Allen     175

In [20]:
df

    Name  Age  Height  Weight
0  Allen   25     175      75

In [21]:
df[["Age", "Weight"]]

   Age  Weight
0   25      75

In [22]:
df.loc[1] = ["Ted", 30, 180, 80]

In [23]:
df

    Name  Age  Height  Weight
0  Allen   25     175      75
1    Ted   30     180      80

In [24]:
df["Weight"]

0    75
1    80
Name: Weight, dtype: int64

In [25]:
df["Weight"][1]

80

In [26]:
df["Weight"][1] = 85

/var/folders/bv/8bbkzq895db366kq27vw262r0000gn/T/ipykernel_5410/2693747156.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Weight"][1] = 85

In [27]:
df

    Name  Age  Height  Weight
0  Allen   25     175      75
1    Ted   30     180      85

In [28]:
df2 = df

In [29]:
df2["Weight"][1] = 80

/var/folders/bv/8bbkzq895db366kq27vw262r0000gn/T/ipykernel_5410/590445440.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2["Weight"][1] = 80

In [30]:
df2

    Name  Age  Height  Weight
0  Allen   25     175      75
1    Ted   30     180      80

In [31]:
df

    Name  Age  Height  Weight
0  Allen   25     175      75
1    Ted   30     180      80

In [32]:
df2 = df.copy()

In [33]:
df["Height"] = 177

In [34]:
df

    Name  Age  Height  Weight
0  Allen   25     177      75
1    Ted   30     177      80

In [35]:
df["Height"] + df["Weight"]

0    252
1    257
dtype: int64

In [36]:
df["BMI"] = df["Weight"] / (df["Height"] / 100) ** 2

In [37]:
df

    Name  Age  Height  Weight        BMI
0  Allen   25     177      75  23.939481
1    Ted   30     177      80  25.535446

In [38]:
df.describe()

             Age  Height     Weight        BMI
count   2.000000     2.0   2.000000   2.000000
mean   27.500000   177.0  77.500000  24.737464
std     3.535534     0.0   3.535534   1.128518
min    25.000000   177.0  75.000000  23.939481
25%    26.250000   177.0  76.250000  24.338472
50%    27.500000   177.0  77.500000  24.737464
75%    28.750000   177.0  78.750000  25.136455
max    30.000000   177.0  80.000000  25.535446

In [39]:
df.dtypes

Name       object
Age         int64
Height      int64
Weight      int64
BMI       float64
dtype: object

In [41]:
df["Weight"] = df["Weight"].astype(int)

In [42]:
df

    Name  Age  Height  Weight        BMI
0  Allen   25     177      75  23.939481
1    Ted   30     177      80  25.535446

In [43]:
df2

    Name  Age  Height  Weight
0  Allen   25     175      75
1    Ted   30     180      80

In [45]:
df2["BMI"] = df2["Weight"] / (df2["Height"] / 100) ** 2

In [46]:
df2

    Name  Age  Height  Weight        BMI
0  Allen   25     175      75  24.489796
1    Ted   30     180      80  24.691358

In [47]:
pd.concat([df, df2])

    Name  Age  Height  Weight        BMI
0  Allen   25     177      75  23.939481
1    Ted   30     177      80  25.535446
0  Allen   25     175      75  24.489796
1    Ted   30     180      80  24.691358

In [52]:
df3 = pd.concat([df, df2]).reset_index(drop=True)

In [53]:
df3

    Name  Age  Height  Weight        BMI
0  Allen   25     177      75  23.939481
1    Ted   30     177      80  25.535446
2  Allen   25     175      75  24.489796
3    Ted   30     180      80  24.691358

In [54]:
data = [
    ["Allen", 25, 175],
    ["Ted", 28, 180],
]

columns = ["Name", "Age", "Height"]

df4 = pd.DataFrame(
    data=data,
    columns=columns,
)

In [55]:
df4

    Name  Age  Height
0  Allen   25     175
1    Ted   28     180